#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/27f08772-a91f-42b7-b9fc-04ba66329976/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.k3s_cluster.data.cloudinit_config.k3s_worker will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "k3s_worker" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.k3s_cluster.aws_instance.k3s_server must be replaced
-/+ resource "aws_instance" "k3s_server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:767828766511:instance/i-0d5823a7d23ec48d1" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0d5823a7d23ec48d1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-06f516372d05bbf30" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-128.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.128" -> (known after apply)
      ~ public_dns                           = "ec2-44-203-246-94.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.203.246.94" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-005e2d49196926ebe" -> "subnet-0b4c60b74a34fe3b6" # forces replacement
        tags                                 = {
            "Name" = "k3s-master"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "6d46415b1cffe40e12fdb4bac14a1392a2cb2ecc" -> "b1513986f48e2c79e5d3a07a4d0b7c0e1d74b0cc" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-045d2d68b8cc941cc",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "edu:project" = "rs-school"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06dbb2c93a55915a7" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.k3s_cluster.aws_instance.k3s_worker[0] must be replaced
-/+ resource "aws_instance" "k3s_worker" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:767828766511:instance/i-0e07467bc47f978fe" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0e07467bc47f978fe" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e2cf32f062397036" -> (known after apply)
      ~ private_dns                          = "ip-10-0-3-157.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.3.157" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "k3s-worker-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "dae9e8c879a3558f210d647364c6053dc2ee724d" -> (known after apply) # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-07b2e66cafeba6ea3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "edu:project" = "rs-school"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07dd170309e83dcf9" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.k3s_cluster.aws_instance.k3s_worker[1] must be replaced
-/+ resource "aws_instance" "k3s_worker" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:767828766511:instance/i-08aa36eda66cef25a" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-08aa36eda66cef25a" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05c7d834c2d377a13" -> (known after apply)
      ~ private_dns                          = "ip-10-0-4-68.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.4.68" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "k3s-worker-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "dae9e8c879a3558f210d647364c6053dc2ee724d" -> (known after apply) # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-07b2e66cafeba6ea3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "edu:project" = "rs-school"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-094b90ee2e822ba14" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.k3s_cluster.aws_security_group.k3s will be created
  + resource "aws_security_group" "k3s" {
      + arn                    = (known after apply)
      + description            = "Security group for K3s nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = [
                  + "sg-097ef9467fb9a058e",
                ]
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow intra communication"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "k3s-worker"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "edu:project" = "rs-school"
        }
      + vpc_id                 = "vpc-087485893ed49dec1"
    }

  # module.k3s_cluster.aws_security_group.k3s_master will be destroyed
  # (because aws_security_group.k3s_master is not in configuration)
  - resource "aws_security_group" "k3s_master" {
      - arn                    = "arn:aws:ec2:us-east-1:767828766511:security-group/sg-045d2d68b8cc941cc" -> null
      - description            = "Security group for K3s master node" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-045d2d68b8cc941cc" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6443
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-097ef9467fb9a058e",
                ]
              - self             = false
              - to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "k3s-master" -> null
      - owner_id               = "767828766511" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "edu:project" = "rs-school"
        } -> null
      - vpc_id                 = "vpc-087485893ed49dec1" -> null
        # (1 unchanged attribute hidden)
    }

  # module.k3s_cluster.aws_security_group.k3s_worker will be destroyed
  # (because aws_security_group.k3s_worker is not in configuration)
  - resource "aws_security_group" "k3s_worker" {
      - arn                    = "arn:aws:ec2:us-east-1:767828766511:security-group/sg-07b2e66cafeba6ea3" -> null
      - description            = "Security group for K3s worker nodes" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-07b2e66cafeba6ea3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-045d2d68b8cc941cc",
                  - "sg-097ef9467fb9a058e",
                ]
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow intra communication"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> null
      - name                   = "k3s-worker" -> null
      - owner_id               = "767828766511" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "edu:project" = "rs-school"
        } -> null
      - vpc_id                 = "vpc-087485893ed49dec1" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 5 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.k3s_cluster.data.cloudinit_config.k3s_worker will be read during apply%0A  # (config refers to values not yet known)%0A <= data "cloudinit_config" "k3s_worker" {%0A      + base64_encode = true%0A      + boundary      = (known after apply)%0A      + gzip          = true%0A      + id            = (known after apply)%0A      + rendered      = (known after apply)%0A%0A      + part {%0A          + content      = (known after apply)%0A          + content_type = "text/cloud-config"%0A        }%0A    }%0A%0A  # module.k3s_cluster.aws_instance.k3s_server must be replaced%0A-/+ resource "aws_instance" "k3s_server" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:767828766511:instance/i-0d5823a7d23ec48d1" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 2 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-0d5823a7d23ec48d1" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-06f516372d05bbf30" -> (known after apply)%0A      ~ private_dns                          = "ip-10-0-1-128.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.0.1.128" -> (known after apply)%0A      ~ public_dns                           = "ec2-44-203-246-94.compute-1.amazonaws.com" -> (known after apply)%0A      ~ public_ip                            = "44.203.246.94" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [] -> (known after apply)%0A      + spot_instance_request_id             = (known after apply)%0A      ~ subnet_id                            = "subnet-005e2d49196926ebe" -> "subnet-0b4c60b74a34fe3b6" # forces replacement%0A        tags                                 = {%0A            "Name" = "k3s-master"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      ~ user_data                            = "6d46415b1cffe40e12fdb4bac14a1392a2cb2ecc" -> "b1513986f48e2c79e5d3a07a4d0b7c0e1d74b0cc" # forces replacement%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-045d2d68b8cc941cc",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification (known after apply)%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      ~ cpu_options (known after apply)%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 2 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "unlimited" -> null%0A        }%0A%0A      ~ ebs_block_device (known after apply)%0A%0A      ~ enclave_options (known after apply)%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      ~ ephemeral_block_device (known after apply)%0A%0A      ~ instance_market_options (known after apply)%0A%0A      ~ maintenance_options (known after apply)%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      ~ metadata_options (known after apply)%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      ~ network_interface (known after apply)%0A%0A      ~ private_dns_name_options (known after apply)%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      ~ root_block_device (known after apply)%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - tags_all              = {%0A              - "edu:project" = "rs-school"%0A            } -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-06dbb2c93a55915a7" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.k3s_cluster.aws_instance.k3s_worker[0] must be replaced%0A-/+ resource "aws_instance" "k3s_worker" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:767828766511:instance/i-0e07467bc47f978fe" -> (known after apply)%0A      ~ associate_public_ip_address          = false -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 2 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-0e07467bc47f978fe" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0e2cf32f062397036" -> (known after apply)%0A      ~ private_dns                          = "ip-10-0-3-157.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.0.3.157" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [] -> (known after apply)%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "Name" = "k3s-worker-1"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      ~ user_data                            = "dae9e8c879a3558f210d647364c6053dc2ee724d" -> (known after apply) # forces replacement%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-07b2e66cafeba6ea3",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification (known after apply)%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      ~ cpu_options (known after apply)%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 2 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "unlimited" -> null%0A        }%0A%0A      ~ ebs_block_device (known after apply)%0A%0A      ~ enclave_options (known after apply)%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      ~ ephemeral_block_device (known after apply)%0A%0A      ~ instance_market_options (known after apply)%0A%0A      ~ maintenance_options (known after apply)%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      ~ metadata_options (known after apply)%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      ~ network_interface (known after apply)%0A%0A      ~ private_dns_name_options (known after apply)%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      ~ root_block_device (known after apply)%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - tags_all              = {%0A              - "edu:project" = "rs-school"%0A            } -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-07dd170309e83dcf9" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.k3s_cluster.aws_instance.k3s_worker[1] must be replaced%0A-/+ resource "aws_instance" "k3s_worker" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:767828766511:instance/i-08aa36eda66cef25a" -> (known after apply)%0A      ~ associate_public_ip_address          = false -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 2 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-08aa36eda66cef25a" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-05c7d834c2d377a13" -> (known after apply)%0A      ~ private_dns                          = "ip-10-0-4-68.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.0.4.68" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [] -> (known after apply)%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "Name" = "k3s-worker-2"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      ~ user_data                            = "dae9e8c879a3558f210d647364c6053dc2ee724d" -> (known after apply) # forces replacement%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-07b2e66cafeba6ea3",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification (known after apply)%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      ~ cpu_options (known after apply)%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 2 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "unlimited" -> null%0A        }%0A%0A      ~ ebs_block_device (known after apply)%0A%0A      ~ enclave_options (known after apply)%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      ~ ephemeral_block_device (known after apply)%0A%0A      ~ instance_market_options (known after apply)%0A%0A      ~ maintenance_options (known after apply)%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      ~ metadata_options (known after apply)%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      ~ network_interface (known after apply)%0A%0A      ~ private_dns_name_options (known after apply)%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      ~ root_block_device (known after apply)%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - tags_all              = {%0A              - "edu:project" = "rs-school"%0A            } -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-094b90ee2e822ba14" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.k3s_cluster.aws_security_group.k3s will be created%0A  + resource "aws_security_group" "k3s" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for K3s nodes"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = [%0A                  + "sg-097ef9467fb9a058e",%0A                ]%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "Allow intra communication"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = true%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = "k3s-worker"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "edu:project" = "rs-school"%0A        }%0A      + vpc_id                 = "vpc-087485893ed49dec1"%0A    }%0A%0A  # module.k3s_cluster.aws_security_group.k3s_master will be destroyed%0A  # (because aws_security_group.k3s_master is not in configuration)%0A  - resource "aws_security_group" "k3s_master" {%0A      - arn                    = "arn:aws:ec2:us-east-1:767828766511:security-group/sg-045d2d68b8cc941cc" -> null%0A      - description            = "Security group for K3s master node" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> null%0A      - id                     = "sg-045d2d68b8cc941cc" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - from_port        = 6443%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 6443%0A                # (1 unchanged attribute hidden)%0A            },%0A          - {%0A              - cidr_blocks      = []%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = [%0A                  - "sg-097ef9467fb9a058e",%0A                ]%0A              - self             = false%0A              - to_port          = 22%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> null%0A      - name                   = "k3s-master" -> null%0A      - owner_id               = "767828766511" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {%0A          - "edu:project" = "rs-school"%0A        } -> null%0A      - vpc_id                 = "vpc-087485893ed49dec1" -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.k3s_cluster.aws_security_group.k3s_worker will be destroyed%0A  # (because aws_security_group.k3s_worker is not in configuration)%0A  - resource "aws_security_group" "k3s_worker" {%0A      - arn                    = "arn:aws:ec2:us-east-1:767828766511:security-group/sg-07b2e66cafeba6ea3" -> null%0A      - description            = "Security group for K3s worker nodes" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> null%0A      - id                     = "sg-07b2e66cafeba6ea3" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = [%0A                  - "sg-045d2d68b8cc941cc",%0A                  - "sg-097ef9467fb9a058e",%0A                ]%0A              - self             = false%0A              - to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A          - {%0A              - cidr_blocks      = []%0A              - description      = "Allow intra communication"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = true%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - name                   = "k3s-worker" -> null%0A      - owner_id               = "767828766511" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {%0A          - "edu:project" = "rs-school"%0A        } -> null%0A      - vpc_id                 = "vpc-087485893ed49dec1" -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 4 to add, 0 to change, 5 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pushed by: @xorzee, Action: `pull_request`*